; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 434087 2 1 4 5 2
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	spectrograph2 - mode
	image1 - mode
	image3 - mode
	image0 - mode
	Star0 - direction
	Star1 - direction
	Star4 - direction
	GroundStation3 - direction
	Star2 - direction
	Planet5 - direction
	Planet6 - direction
)
(:init
	(supports instrument0 image3)
	(supports instrument0 image1)
	(calibration_target instrument0 GroundStation3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star0)
	(supports instrument1 image0)
	(supports instrument1 spectrograph2)
	(supports instrument1 image3)
	(calibration_target instrument1 Star2)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star2)
)
(:goal (and
	(pointing satellite1 Star4)
	(have_image Planet5 image1)
	(have_image Planet6 spectrograph2)
))

)

; plan
1. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 3
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 3
3. (turn_to satellite0 planet5 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 planet5)
   goals met: 0 of 3
4. (calibrate satellite1 instrument1 star2)
   added: (calibrated instrument1)
   goals met: 0 of 3
5. (turn_to satellite0 groundstation3 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 groundstation3)
   goals met: 0 of 3
6. (turn_to satellite1 star4 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 star4)
   goals met: 1 of 3
7. (calibrate satellite0 instrument0 groundstation3)
   added: (calibrated instrument0)
   goals met: 1 of 3
8. (turn_to satellite0 planet5 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 planet5)
   goals met: 1 of 3
9. (turn_to satellite1 planet6 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 planet6)
   goals met: 0 of 3
10. (take_image satellite0 planet5 instrument0 image1)
   added: (have_image planet5 image1)
   goals met: 1 of 3
11. (take_image satellite1 planet6 instrument1 spectrograph2)
   added: (have_image planet6 spectrograph2)
   goals met: 2 of 3
12. (turn_to satellite1 star4 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 star4)
   goals met: 3 of 3
